src/cf/InformationRegisters/НастройкиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущаяКонфигурацияИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяКонфигурацияПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Релизы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОтборПоСтатусу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтборПоСтатусу</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПравил</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыСвойств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидыСубконтоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Измерение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборДвиженийРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборЗаписейПодчиненногоРегистраСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборЗаписейПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодчиненныйСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свойство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоставПланаОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементСоставаПланаОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникПодпискиНаСобытие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидСубконто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Календарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаборКонстант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перечисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТочкаМаршрутаБизнесПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХранилищеЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодпискаНаСобытие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыОбщихРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОбщихРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщаяТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаОбщихСвойств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючевыеСвойства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыКонвертаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКонвертаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XDTO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Объекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Релизы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иерархический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИерархии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиватьКоличествоУровней</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУровней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерииКодов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>29</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольУникальности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНумерация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подчиненный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВышестоящегоРелиза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Алгоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Алгоритмы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнаяКопия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеМодули</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Захвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяПриЗагрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонвертации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонвертаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьГруппыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТегВырезки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспортный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоФункция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/КонвертацияДанныхXDTOВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ФОРМИРОВАНИЕ_СПИСКОВ_ДЛЯ_ВЫБОРА_ОБЪЕКТОВ_В_ДИАЛОГАХ
// Заполнение списка объектов конфигурации для указанных конвертаций.
// Параметры:
//   ПолучательОбъектовКонфигурации - СписокЗначений - заполняемый список. 
//                                   Может передаваться также и таблица значений.
//   ДанныеФильтра - массив - Массив, содержащий конфигурации, либо структура содержащая план обмена и конфигурацию.
//   ОбластьПрименения - Структура - содержит параметры типа Булево, определяющие для какого правила заполняется список
//    ДляПКО - для правила конвертации объектов либо для правила обработки данных.
//    ДляПКПД - для правила конвертации предопределенных данных.
//    ДляПРО - для правила регистрации объектов.
Процедура ЗаполнитьСписокОбъектовКонфигурации(ПолучательОбъектовКонфигурации, ДанныеФильтра, ОбластьПрименения) Экспорт
	ПолучательОбъектовКонфигурации.Очистить();
	Если НЕ ЗначениеЗаполнено(ДанныеФильтра) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;

	Если ОбластьПрименения.ДляПРО Тогда
		Запрос.УстановитьПараметр("ПланОбмена",ДанныеФильтра.ПланОбмена);
		Запрос.УстановитьПараметр("Владелец",ДанныеФильтра.Конфигурация);

		ТекстЗапроса = "ВЫБРАТЬ
		|	СвойстваТипы.Тип                    КАК Объект,
		|	СвойстваТипы.Ссылка.Авторегистрация КАК Авторегистрация
		|ПОМЕСТИТЬ СоставПланаОбмена
		|ИЗ
		|	Справочник.Свойства.Типы КАК СвойстваТипы
		|ГДЕ
		|	  СвойстваТипы.Ссылка.Владелец.Наименование = &ПланОбмена
		|	И СвойстваТипы.Ссылка.Владелец.Владелец = &Владелец
		|	И СвойстваТипы.Ссылка.Вид      = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ЭлементСоставаПланаОбмена)
		|;
		|
		|ВЫБРАТЬ
		|	СправочникОбъекты.Наименование КАК Наименование,
		|	СправочникОбъекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Объекты КАК СправочникОбъекты
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	СоставПланаОбмена КАК СоставПланаОбмена
		|ПО
		|	СправочникОбъекты.Ссылка = СоставПланаОбмена.Объект
		|
		|ГДЕ
		|	НЕ СправочникОбъекты.ПометкаУдаления
		|	И СправочникОбъекты.ЭтоГруппа = ЛОЖЬ
		|	И СправочникОбъекты.Владелец = &Владелец
		|	И СправочникОбъекты.Наименование <> ""РегистрСведенийЗапись.СоответствиеОбъектовИнформационныхБаз""
		|	И НЕ СоставПланаОбмена.Объект ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	СправочникОбъекты.ЭтоГруппа ИЕРАРХИЯ,
		|	СправочникОбъекты.Наименование
		|";
	Иначе
		Если ТипЗнч(ДанныеФильтра) = Тип("СправочникСсылка.Релизы") Тогда
			Запрос.УстановитьПараметр("Конфигурация",ДанныеФильтра);
		ИначеЕсли ТипЗнч(ДанныеФильтра) = Тип("СписокЗначений") Тогда
			Запрос.УстановитьПараметр("Конфигурация",ДанныеФильтра[0].Значение);
		Иначе
			Запрос.УстановитьПараметр("Конфигурация",ДанныеФильтра[0]);
		КонецЕсли;
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Объекты.Наименование КАК Наименование,
		|	Объекты.Ссылка,
		|	Объекты.Тип КАК Тип
		|ПОМЕСТИТЬ ТаблицаОбъектов
		|ИЗ Справочник.Объекты КАК Объекты
		|ГДЕ Объекты.ПометкаУдаления = ЛОЖЬ И Объекты.ЭтоГруппа = ЛОЖЬ 
		|	И Объекты.Владелец = &Конфигурация
		|#УСЛОВИЕ_ПК#
		|;
		|ВЫБРАТЬ
		|	Наименование,
		|	Ссылка
		|ИЗ ТаблицаОбъектов
		|УПОРЯДОЧИТЬ ПО Наименование";
		
		Если ОбластьПрименения.ДляПКПД Тогда
			ТекстУсловиеПК = "
			|	И (Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Справочник) 
			|		ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Перечисление)
			|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовРасчета)
			|		ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланСчетов)
			|		ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик))";
		Иначе	
			ТекстУсловиеПК = "И (Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Справочник) 
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.РегистрСведений)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовРасчета)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.НаборКонстант) 
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланСчетов)
							|	ИЛИ Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик))";
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#УСЛОВИЕ_ПК#", ТекстУсловиеПК);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	ДобавлятьВТаблицу = Истина;
	Если ТипЗнч(ПолучательОбъектовКонфигурации) = Тип("СписокЗначений") Тогда
		ДобавлятьВТаблицу = Ложь;
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
		Если ДобавлятьВТаблицу Тогда
			СтрокаОбъект = ПолучательОбъектовКонфигурации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОбъект, Выборка);
			СтрокаОбъект.Наименование = СокрЛП(СтрокаОбъект.Наименование);
		Иначе
			ПолучательОбъектовКонфигурации.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Заполнение списка объектов формата для указанных конвертаций.
// Параметры:
//  ПолучательОбъектовФормата - СписокЗначений - заполняемый список. 
//                                   Может передаваться также и таблица значений.
//  МассивКонвертаций - Массив - массив, содержащий конвертации.
//  ДляПКО - булево - признак того что заполнение происходит для правила конвертации объектов.
//  ДляПКПД - булево - признак того что заполнение происходит для правила конвертации предопределенных данных.
//  ВерсияФормата - СправочникСсылка.ВерсияФормата - Версия формата, для которой заполняется список объектов.
Процедура ЗаполнитьСписокОбъектовФормата(ПолучательОбъектовФормата, МассивКонвертаций, ДляПКО = Ложь, ДляПКПД = Ложь, ВерсияФормата = Неопределено) Экспорт
	ПолучательОбъектовФормата.Очистить();
	Если НЕ ЗначениеЗаполнено(МассивКонвертаций)
		И ВерсияФормата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;

	СтруктураПараметров = Новый Структура("ДляПКО, ДляПКПД", ДляПКО, ДляПКПД);
	СтруктураПараметров.Вставить("ДляПроектирования", Ложь);
	СтруктураПараметров.Вставить("ОтборПоВерсиям", Ложь);
	СтруктураПараметров.Вставить("ОтборПоКонвертациям", Ложь);
	Если ВерсияФормата <> Неопределено Тогда
		СтруктураПараметров.Вставить("ДляПроектирования", Истина);
		Если ЗначениеЗаполнено(ВерсияФормата) Тогда
			СтруктураПараметров.ОтборПоВерсиям = Истина;
			Запрос.УстановитьПараметр("ВерсияФормата",ВерсияФормата);
		КонецЕсли;
	Иначе
		СтруктураПараметров.ОтборПоКонвертациям = Истина;
		Запрос.УстановитьПараметр("МассивКонвертаций",МассивКонвертаций);
	КонецЕсли;
	ТекстЗапроса = ПолучитьТекстЗапросаСписокОбъектовФормата(СтруктураПараметров);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	ДобавлятьВТаблицу = Истина;
	Если ТипЗнч(ПолучательОбъектовФормата) = Тип("СписокЗначений") Тогда
		ДобавлятьВТаблицу = Ложь;
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если ДобавлятьВТаблицу Тогда
			СтрокаОбъект = ПолучательОбъектовФормата.Добавить();
			СтрокаОбъект.Наименование = СокрЛП(Выборка.Наименование);
		Иначе
			ПолучательОбъектовФормата.Добавить(СокрЛП(Выборка.Наименование));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Формирование текста запроса для получения списка объектов формата.
// Параметры:
//  СтруктураПараметров - Структура - сведения о контексте выбора объекта формата.
//   * ДляПКО - Булево, признак того что список вызывается в контексте ПКО.
//   * ДляПКПД - Булево, признак того что список вызывается в контексте ПКПД.
//   * ОтборПоВерсиям - Булево, признак того что отбор следует проводить по версии формата.
//   * ОтборПоКонвертациям - Булево, признак того что отбор следует проводить по конвертациям.
//   * СУпорядочиванием - Булево, признак необходимости упорядочить список.
//   * ДляПроектирования - Булево, признак работы в контексте проектирования формата.
// Возвращаемое значение:
//  Строка - Текст запроса.
Функция ПолучитьТекстЗапросаСписокОбъектовФормата(СтруктураПараметров) Экспорт
	ТекстЗапроса = "";
	Если СтруктураПараметров.ОтборПоКонвертациям = Истина Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|ВерсияФормата
		|ПОМЕСТИТЬ ВерсииИзКонвертаций
		|ИЗ Справочник.Конвертации.ВерсииФормата
		|ГДЕ Ссылка В (&МассивКонвертаций)
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|Расширение КАК ВерсияФормата
		|ПОМЕСТИТЬ ВерсииИзРасширений
		|ИЗ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений
		|ГДЕ ВерсияФорматаОбмена В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзКонвертаций)
		|;
		|";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ОбъектыФормата.Наименование
	|ИЗ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|#СОЕДИНЕНИЕ_ПК#
	|ГДЕ ОбъектыФормата.ПометкаУдаления = ЛОЖЬ И ОбъектыФормата.ЭтоГруппа = ЛОЖЬ
	|				#УсловиеВерсияФормата#
	|#УСЛОВИЕ_ПК#
	|УПОРЯДОЧИТЬ ПО ОбъектыФормата.Наименование";
	ТекстСоединениеПК = "";
	ТекстУсловиеПК = "";
	Если СтруктураПараметров.ДляПКО = Истина Тогда
		ТекстСоединениеПК = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ Владелец ИЗ Справочник.СвойстваФормата) КАК Свойства
		|ПО Свойства.Владелец = ОбъектыФормата.Ссылка";
		ТекстУсловиеПК = "
		|	И (ОбъектыФормата.Наименование ПОДОБНО ""Справочник.%"" ИЛИ ОбъектыФормата.Наименование ПОДОБНО ""Документ.%"")";
	ИначеЕсли СтруктураПараметров.ДляПКПД Тогда
		ТекстСоединениеПК = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ Владелец ИЗ Справочник.ЗначенияФормата) КАК Значения
		|ПО Значения.Владелец = ОбъектыФормата.Ссылка";
	Иначе
		Если СтруктураПараметров.ДляПроектирования = Истина Тогда
			ТекстУсловиеПК = "И НЕ (ОбъектыФормата.Наименование ПОДОБНО ""КлючевыеСвойства%"" ИЛИ ОбъектыФормата.Наименование ПОДОБНО ""Info%"")";
		Иначе
			ТекстУсловиеПК = "И (ОбъектыФормата.Наименование ПОДОБНО ""Справочник.%"" ИЛИ ОбъектыФормата.Наименование ПОДОБНО ""Документ.%"")";
		КонецЕсли;
	КонецЕсли;
	ТекстУсловиеВерсияФормата = "";
	Если СтруктураПараметров.ОтборПоВерсиям = Истина Тогда
		ТекстУсловиеВерсияФормата = " И (ОбъектыФормата.Владелец = &ВерсияФормата
		|								ИЛИ ОбъектыФормата.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ Расширение
		|									ИЗ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений
		|									ГДЕ ВерсияФорматаОбмена = &ВерсияФормата))";
	ИначеЕсли СтруктураПараметров.ОтборПоКонвертациям = Истина Тогда
		ТекстУсловиеВерсияФормата = " И (ОбъектыФормата.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзКонвертаций)
		|								ИЛИ ОбъектыФормата.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзРасширений))";
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#СОЕДИНЕНИЕ_ПК#", ТекстСоединениеПК);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#УСЛОВИЕ_ПК#", ТекстУсловиеПК);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#УсловиеВерсияФормата#", ТекстУсловиеВерсияФормата);
	Возврат ТекстЗапроса;
КонецФункции

// Заполнение списка значений конфигурации для правил конвертации предопределенных данных.
// Параметры:
//  СписокЗначенийКонфигурации - СписокЗначений - заполняемый список.
//  МассивКонфигураций - Массив - Массив, содержащий конфигурации.
//  ОбъектКонфигурации - Строка - объект конфигурации для которого настраивается ПКПД.
Процедура ЗаполнитьСписокЗначенийКонфигурации(СписокЗначенийКонфигурации, МассивКонфигураций, ОбъектКонфигурации) Экспорт
	СписокЗначенийКонфигурации.Очистить();
	Если НЕ ЗначениеЗаполнено(ОбъектКонфигурации) 
		ИЛИ НЕ ЗначениеЗаполнено(МассивКонфигураций) Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапроса = "ВЫБРАТЬ
	|	Наименование КАК Имя,
	|	Владелец.Владелец КАК Конфигурация
	|ПОМЕСТИТЬ ТаблицаЗначенийКонфигураций
	|ИЗ Справочник.Значения
	|ГДЕ Владелец = &ОбъектКонфигурации
	|	И ПометкаУдаления = ЛОЖЬ
	|	И Владелец.Владелец В (&МассивКонфигураций)
	|;
	|ВЫБРАТЬ
	|	Имя,
	|	Количество(Конфигурация)
	|ИЗ ТаблицаЗначенийКонфигураций
	|СГРУППИРОВАТЬ ПО Имя
	|УПОРЯДОЧИТЬ ПО Имя";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурации);
	Запрос.УстановитьПараметр("МассивКонфигураций",МассивКонфигураций);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначенийКонфигурации.Добавить(СокрЛП(Выборка.Имя));
	КонецЦикла;
КонецПроцедуры

// Заполнение списка значений формата для правил конвертации предопределенных данных.
// Параметры:
//  СписокЗначенийФормата - СписокЗначений - заполняемый список.
//  МассивКонвертаций - Массив - массив, содержащий конвертации.
//  ОбъектФормата - Строка - объект формата для которого настраивается ПКПД.
Процедура ЗаполнитьСписокЗначенийФормата(СписокЗначенийФормата, МассивКонвертаций, ОбъектФормата) Экспорт
	СписокЗначенийФормата.Очистить();
	Если НЕ ЗначениеЗаполнено(ОбъектФормата)
		ИЛИ НЕ ЗначениеЗаполнено(МассивКонвертаций) Тогда
		Возврат;
	КонецЕсли;
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧВерсииФормата.ВерсияФормата КАК ВерсияФормата
	|ПОМЕСТИТЬ ВерсииФормата
	|ИЗ
	|	Справочник.Конвертации.ВерсииФормата КАК ТЧВерсииФормата
	|ГДЕ
	|	ТЧВерсииФормата.Ссылка В(&МассивКонвертаций)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|Расширение КАК ВерсияФормата
	|ПОМЕСТИТЬ ВерсииИзРасширений
	|ИЗ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений
	|ГДЕ ВерсияФорматаОбмена В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|ЗначенияФормата.Наименование КАК Имя
	|ИЗ
	|	Справочник.ВерсииФормата КАК ВерсииФормата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|		ПО ОбъектыФормата.Владелец = ВерсииФормата.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияФормата КАК ЗначенияФормата
	|		ПО ЗначенияФормата.Владелец = ОбъектыФормата.Ссылка
	|ГДЕ ОбъектыФормата.Наименование = &ОбъектФорматаИмя
	|	И ЗначенияФормата.ПометкаУдаления = ЛОЖЬ
	|	И (ВерсииФормата.Ссылка В 
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ ВерсияФормата ИЗ ВерсииФормата)
	|		ИЛИ ВерсииФормата.Ссылка В 
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ ВерсияФормата ИЗ ВерсииИзРасширений))
	|УПОРЯДОЧИТЬ ПО ЗначенияФормата.Наименование";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОбъектФорматаИмя", СокрЛП(ОбъектФормата));
	Запрос.УстановитьПараметр("МассивКонвертаций",МассивКонвертаций);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначенийФормата.Добавить(СокрЛП(Выборка.Имя));
	КонецЦикла;
КонецПроцедуры

// Заполнение таблицы свойств конфигурации для правила конвертации объекта.
// Процедура является оберткой, внутри которой вызывается собственно функция заполнения таблицы свойств.
// Параметры:
//  ТаблицаСвойствКонфигурации - ТаблицаЗначений - таблица, содержащая свойства объекта конфигурации.
//  ПКО - СправочникСсылка.ПравилаКонвертацииОбъектов - правило конвертации объекта, для которого настраиваются ПКС.
//  ОбъектКонфигурации - СправочникСсылка.Объекты - объект конфигурации для которого настраиваются ПКС.
//  ФильтрСвойств - Структура - Опциональный фильтр для свойств
//   * ЭтоГруппа - булево - фильтр по группам / элементам
//   * Родитель - Строка - фильтр по имени родителя (если фильтр определен но пуст то выбираются только свойства шапки)
Процедура ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации, ПКО, ОбъектКонфигурации, ФильтрСвойств) Экспорт
	
	ТаблицаСвойствКонфигурации.Очистить();
	Если НЕ ЗначениеЗаполнено(ПКО) 
		ИЛИ НЕ ЗначениеЗаполнено(ОбъектКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	ТаблицаСвойствКонфигурации.Загрузить(ТаблицаСвойствОбъектаКонфигурации(ОбъектКонфигурации, ФильтрСвойств));

КонецПроцедуры

// Заполнение таблицы свойств конфигурации для правила конвертации объекта.
// Параметры:
//  ОбъектКонфигурации - СправочникСсылка.Объекты - объект конфигурации для которого настраиваются ПКС.
//  ФильтрСвойств - Структура - Опциональный фильтр для свойств
//   * ЭтоГруппа - булево - фильтр по группам / элементам
//   * Родитель - Строка - фильтр по имени родителя (если фильтр определен но пуст то выбираются только свойства шапки)
// Возвращаемое значение:
//  ТаблицаЗначений - содержит свойства объекта конфигурации.
Функция ТаблицаСвойствОбъектаКонфигурации(ОбъектКонфигурации, ФильтрСвойств) Экспорт
	ИмяСвойстваКонфигурация = "Конфигурация";
	Если ФильтрСвойств.Свойство("Корреспондент") И ФильтрСвойств.Корреспондент Тогда
		ИмяСвойстваКонфигурация = "КонфигурацияКорреспондент";
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Свойства.Родитель,
		|	Свойства.Наименование,
		|	ВЫБОР КОГДА Свойства.ЭтоГруппа ТОГДА
		|		Свойства.Вид
		|	ИНАЧЕ
		|		ВЫРАЗИТЬ(Свойства.ТипыСтрокой КАК СТРОКА(100))
		|	КОНЕЦ КАК Тип,
		|	Свойства.Ссылка,

		|	Свойства.Владелец.Владелец КАК Конфигурация
		|ПОМЕСТИТЬ ТаблицаСвойствРасширенная
		|ИЗ
		|	Справочник.Свойства КАК Свойства
		|ГДЕ
		|	Свойства.Владелец = &ОбъектКонфигурации
		|	И Свойства.ПометкаУдаления = ЛОЖЬ
		|	%УсловияФильтрСвойств%
		|;
		|ВЫБРАТЬ 
		|	ВЫБОР
		|		КОГДА Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
		|			ТОГДА Наименование
		|		ИНАЧЕ Родитель.Наименование + ""."" + Наименование
		|	КОНЕЦ КАК Имя,
		|	Ссылка,
		|	Максимум(Тип) КАК Тип
		|ИЗ ТаблицаСвойствРасширенная
		|СГРУППИРОВАТЬ ПО 
		|	ВЫБОР
		|		КОГДА Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
		|			ТОГДА Наименование
		|		ИНАЧЕ Родитель.Наименование + ""."" + Наименование
		|	КОНЕЦ,
		|	Ссылка
		|УПОРЯДОЧИТЬ ПО
		|	Имя";
	УсловияФильтрСвойств = "";
	ЭтоГруппа = Неопределено;
	Родитель = Неопределено;
	Если ТипЗнч(ФильтрСвойств) = Тип("Структура") Тогда
		ФильтрСвойств.Свойство("ЭтоГруппа", ЭтоГруппа);
		ФильтрСвойств.Свойство("Родитель", Родитель);
		Если ЭтоГруппа <> Неопределено Тогда
			УсловияФильтрСвойств = УсловияФильтрСвойств + " И Свойства.ЭтоГруппа = &ЭтоГруппа";
			Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоГруппа);
		КонецЕсли;
		Если Родитель <> Неопределено Тогда
			Если ПустаяСтрока(Родитель) Тогда
				УсловияФильтрСвойств = УсловияФильтрСвойств + " И Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)";
			Иначе
				УсловияФильтрСвойств = УсловияФильтрСвойств + " И Свойства.Родитель = &Родитель";
				Запрос.УстановитьПараметр("Родитель", Родитель);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловияФильтрСвойств%", УсловияФильтрСвойств);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурации);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаСвойств;
КонецФункции

// Заполнение таблицы свойств формата для правила конвертации объекта.
// Параметры:
//  ПолучательСвойствФормата - ТаблицаЗначений - таблица, содержащая свойства объекта формата.
//                            Может передаваться также список значений.
//  ПКО - СправочникСсылка.ПравилаКонвертацииОбъектов - правило конвертации объекта, для которого настраиваются ПКС.
//  ФильтрСвойств - Структура - Опциональный фильтр для свойств
//   * ОбъектФормата - строка - объект конфигурации для которого настраиваются ПКС.
//   * ЭтоГруппа - булево - фильтр по группам / элементам
//   * Родитель - Строка - фильтр по имени родителя (если фильтр определен но пуст то выбираются только свойства шапки)
//   * ВерсияФормата - СправочникСсылка.ВерсииФормата - Версия формата, для которого заполняются свойства (при отсутствии ПКО).
Процедура ЗаполнитьСписокСвойствФормата(ПолучательСвойствФормата, ПКО, ФильтрСвойств) Экспорт
	ОбъектФормата = Неопределено;
	ВерсияФормата = Неопределено;
	ЭтоГруппа = Неопределено;
	Родитель = Неопределено;
	ДобавлениеСтрокТаблицы = Неопределено;
	ТипОбщегоСвойства = Неопределено;
	ФильтрСвойств.Свойство("ОбъектФормата", ОбъектФормата);
	ФильтрСвойств.Свойство("ЭтоГруппа", ЭтоГруппа);
	ФильтрСвойств.Свойство("Родитель", Родитель);
	ФильтрСвойств.Свойство("ВерсияФормата", ВерсияФормата);

	ПолучательСвойствФормата.Очистить();
	
	Если (НЕ ЗначениеЗаполнено(ПКО)
			И ВерсияФормата = Неопределено) 
		Или НЕ ЗначениеЗаполнено(ОбъектФормата) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	Если ЗначениеЗаполнено(ПКО) Тогда
		МассивКонвертаций = Новый Массив;
		ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(ПКО, МассивКонвертаций);
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧВерсииФормата.ВерсияФормата КАК ВерсияФормата
		|ПОМЕСТИТЬ ВерсииФормата
		|ИЗ
		|	Справочник.Конвертации.ВерсииФормата КАК ТЧВерсииФормата
		|ГДЕ
		|	ТЧВерсииФормата.Ссылка В(&МассивКонвертаций)
		|;
		|";
		Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		|	Ссылка КАК ВерсияФормата
		|ПОМЕСТИТЬ ВерсииФормата
		|ИЗ
		|	Справочник.ВерсииФормата 
		|ГДЕ
		|	Ссылка = &ВерсияФормата
		|;
		|";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|Расширение КАК ВерсияФормата
	|ПОМЕСТИТЬ ВерсииИзРасширений
	|ИЗ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений
	|ГДЕ ВерсияФорматаОбмена В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата)
	|;
	|ВЫБРАТЬ
	|	СвойстваФормата.Ссылка КАК Свойство,
	|	СвойстваФормата.Родитель КАК Родитель,
	|	СвойстваФормата.Родитель.Наименование КАК ИмяРодителя,
	|	СвойстваФормата.Тип КАК Тип,
	|	СвойстваФормата.Наименование КАК ИмяСвойства,
	|	СвойстваФормата.ЭтоГруппа КАК ЭтоГруппа,
	|	СвойстваФормата.ТипОбщегоСвойства КАК ТипОбщегоСвойства,
	|	ВЫБОР КОГДА ВерсииФормата.Ссылка В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзРасширений) ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Расширение
	|ИЗ
	|	Справочник.ВерсииФормата КАК ВерсииФормата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|		ПО (ОбъектыФормата.Владелец = ВерсииФормата.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата КАК СвойстваФормата
	|		ПО (СвойстваФормата.Владелец = ОбъектыФормата.Ссылка)
	|
	|ГДЕ
	|	(ВерсииФормата.Ссылка В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзРасширений)
	|		ИЛИ ВерсииФормата.Ссылка В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата))
	|	И ОбъектыФормата.Наименование = &ОбъектФорматаИмя
	|	И НЕ СвойстваФормата.ПометкаУдаления
	|	%УсловияФильтрСвойств%
	|	";
	Запрос.УстановитьПараметр("ОбъектФорматаИмя", СокрЛП(ОбъектФормата));
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата);
	УсловияФильтрСвойств = "";
	Если ЭтоГруппа <> Неопределено Тогда
		УсловияФильтрСвойств = УсловияФильтрСвойств + " И СвойстваФормата.ЭтоГруппа = &ЭтоГруппа";
		Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоГруппа);
		Если ЭтоГруппа = Истина Тогда
			// При выборе группы доступны только ТЧ и ОбщиеТЧ
			УсловияФильтрСвойств = УсловияФильтрСвойств + " И (СвойстваФормата.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка)
						| ИЛИ СвойстваФормата.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть))";
			Запрос.УстановитьПараметр("ТипОбщегоСвойства", ТипОбщегоСвойства);
		КонецЕсли;
	КонецЕсли;
	Если Родитель <> Неопределено Тогда
		Если ПустаяСтрока(Родитель) Тогда
			УсловияФильтрСвойств = УсловияФильтрСвойств + " И (СвойстваФормата.Родитель = ЗНАЧЕНИЕ(Справочник.СвойстваФормата.ПустаяСсылка)
				// Реквизиты входящие в ключевые свойства или в группы общих свойств.
				| ИЛИ СвойстваФормата.Родитель.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.КлючевыеСвойства)
				| ИЛИ СвойстваФормата.Родитель.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ГруппаОбщихСвойств))";
		Иначе
			УсловияФильтрСвойств = УсловияФильтрСвойств + " И СвойстваФормата.Родитель В ИЕРАРХИИ
				|( ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ Справочник.СвойстваФормата 
				|	ГДЕ ЭтоГруппа И Наименование = &Родитель И 
				|	(Владелец.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииИзРасширений)
				|		ИЛИ Владелец.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата)))";
			Запрос.УстановитьПараметр("Родитель", Родитель);
		КонецЕсли;			
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловияФильтрСвойств%", УсловияФильтрСвойств);
	
	ТаблицаСвойства = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ОтображаемоеИмя", Новый ОписаниеТипов("Строка"));
	ТаблицаРезультат.Колонки.Добавить("Тип",     Новый ОписаниеТипов("Строка"));
	ТаблицаРезультат.Колонки.Добавить("ИмяТЧ",   Новый ОписаниеТипов("Строка"));
	
	СтрокиСвойстваИзРасширения = ТаблицаСвойства.НайтиСтроки(Новый Структура("Расширение", Истина));
	ЕстьСвойстваИзРасширения = СтрокиСвойстваИзРасширения.Количество() > 0;
	
	ВышестоящиеРодители = Новый Соответствие();
	Для Каждого СтрокаСвойства Из ТаблицаСвойства Цикл
		
		Если ЕстьСвойстваИзРасширения И СтрокаСвойства.Расширение = Ложь Тогда
			СтруктураПоиска = Новый Структура("ИмяСвойства, ИмяРодителя, ЭтоГруппа");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаСвойства);
			СтруктураПоиска.Вставить("Расширение", Истина);
			СтрокиСвойстваИзРасширения = ТаблицаСвойства.НайтиСтроки(СтруктураПоиска);
			Если СтрокиСвойстваИзРасширения.Количество() > 0 Тогда
				// При наличии такого же свойства в расширении берем свойство из расширения.
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаСвойства.Родитель) Тогда
			// "Обычное" свойство.
			СтрокаРезультат = ТаблицаРезультат.Добавить();
			СтрокаРезультат.ОтображаемоеИмя = СтрокаСвойства.ИмяСвойства;
			СтрокаРезультат.Тип   = СтрокаСвойства.Тип;
		Иначе
			СтрокаРодитель = РодительВерхнегоУровня(СтрокаСвойства.Родитель, ВышестоящиеРодители);
			Если ВышестоящиеРодители.Получить(СтрокаСвойства.Родитель) = Неопределено Тогда
				ВышестоящиеРодители.Вставить(СтрокаСвойства.Родитель, СтрокаРодитель);
			КонецЕсли;
			Если СтрокаРодитель.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.КлючевыеСвойства Тогда
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				СтрокаРезультат.ОтображаемоеИмя = СтрокаСвойства.ИмяСвойства;
				СтрокаРезультат.Тип = СтрокаСвойства.Тип;
			ИначеЕсли СтрокаРодитель.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть Тогда
				// Общая табличная часть.
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				СтрокаРезультат.ОтображаемоеИмя = СтрокаРодитель.Наименование + "." + СтрокаСвойства.ИмяСвойства;
				СтрокаРезультат.Тип = СтрокаСвойства.Тип;
				СтрокаРезультат.ИмяТЧ = СтрокаРодитель.Наименование;
			ИначеЕсли СтрокаРодитель.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ГруппаОбщихСвойств Тогда
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				СтрокаРезультат.ОтображаемоеИмя = СтрокаСвойства.ИмяСвойства;
				СтрокаРезультат.Тип = СтрокаСвойства.Тип;
				// Добавление реквизита - самой группы общих свойств.
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				СтрокаРезультат.ОтображаемоеИмя = СтрокаРодитель.Наименование;
				СтрокаРезультат.Тип = СтрокаРодитель.Тип;
			Иначе
				// "Обычная" табличная часть.
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				СтрокаРезультат.ОтображаемоеИмя = СтрокаРодитель.Наименование + "." + СтрокаСвойства.ИмяСвойства;
 				СтрокаРезультат.Тип = СтрокаСвойства.Тип;
				СтрокаРезультат.ИмяТЧ = СтрокаРодитель.Наименование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРезультат.Свернуть("ОтображаемоеИмя, Тип, ИмяТЧ");
	ТаблицаРезультат.Сортировать("ИмяТЧ, ОтображаемоеИмя");
	
	// Определить что это - таблица или список значений
	ДобавлениеСтрокТаблицы = Ложь;
	Если ТипЗнч(ПолучательСвойствФормата) = Тип("ТаблицаЗначений") Тогда
		ДобавлениеСтрокТаблицы = Истина;
	ИначеЕсли ТипЗнч(ПолучательСвойствФормата) = Тип("ДанныеФормыКоллекция") Тогда
		НоваяСтрока = ПолучательСвойствФормата.Добавить();
		Если НоваяСтрока.Свойство("ИмяТЧ") Тогда
			ДобавлениеСтрокТаблицы = Истина;
		КонецЕсли;
		ПолучательСвойствФормата.Очистить();
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		Если ДобавлениеСтрокТаблицы Тогда
			НоваяСтрока = ПолучательСвойствФормата.Добавить();
			НоваяСтрока.Имя = Строка.ОтображаемоеИмя;
			НоваяСтрока.Тип = Строка.Тип;
			НоваяСтрока.ИмяТЧ = Строка.ИмяТЧ;
		Иначе
			// Работа со списком значений.
			ПолучательСвойствФормата.Добавить(Строка.ОтображаемоеИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполнение списка правил конвертаций объекта для выбора в правиле обработки данных.
// Параметры:
//  СписокПКО - СписокЗначений - заполняемый список.
//  МассивКонвертаций - Массив - массив, содержащий конвертации
//  ИспользоватьДляОтправки - Булево - признак использования для отправки.
//  ИспользоватьДляПолучения - Булево - признак использования для получения.
//  ОбъектКонфигурации - СправочникСсылка.Объекты - Объект конфигурации для которого настраивается правило обработки данных.
//  ИмяОбъектаФормата - строка - имя объекта формата для которого настраивается правило обработки данных.
Процедура ЗаполнитьСписокПКО(СписокПКО, МассивКонвертаций, ИспользоватьДляОтправки, ИспользоватьДляПолучения, ОбъектКонфигурации, ИмяОбъектаФормата) Экспорт
	СписокПКО.Очистить();
	Если НЕ ЗначениеЗаполнено(МассивКонвертаций) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПКО.Код КАК Имя,
	|	СоставКонвертаций.Владелец КАК Конвертация
	|ПОМЕСТИТЬ ТаблицаПКО
	|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК СоставКонвертаций
	|ПО СоставКонвертаций.ЭлементКонвертации = ПКО.Ссылка
	|	И СоставКонвертаций.Владелец В (&МассивКонвертаций)
	|	И СоставКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ
	|	%УсловиеИспользоватьДляОтправки%
	|	И %УсловиеИспользоватьДляПолучения%
	|	И %УсловиеОбъектКонфигурации%
	|	И %УсловиеОбъектФормата%
	|;
	|ВЫБРАТЬ
	|	Имя,
	|	Количество(Конвертация)
	|ИЗ ТаблицаПКО
	|СГРУППИРОВАТЬ ПО Имя
	|ИМЕЮЩИЕ Количество(Конвертация) = &КоличествоЭлементов
	|УПОРЯДОЧИТЬ ПО Имя
	|";
	Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
	Запрос.УстановитьПараметр("КоличествоЭлементов", МассивКонвертаций.Количество());
	Если ИспользоватьДляОтправки <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеИспользоватьДляОтправки%", "ПКО.ИспользоватьДляОтправки = &ИспользоватьДляОтправки");
		Запрос.УстановитьПараметр("ИспользоватьДляОтправки", ИспользоватьДляОтправки);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеИспользоватьДляОтправки%", "Истина");
	КонецЕсли;
	Если ИспользоватьДляПолучения <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеИспользоватьДляПолучения%", "ПКО.ИспользоватьДляПолучения = &ИспользоватьДляПолучения");
		Запрос.УстановитьПараметр("ИспользоватьДляПолучения", ИспользоватьДляПолучения);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеИспользоватьДляПолучения%", "Истина");
	КонецЕсли;
	Если ОбъектКонфигурации <> Неопределено Тогда
		Если МассивКонвертаций.Количество() = 1 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОбъектКонфигурации%", "ПКО.ОбъектКонфигурации = &ОбъектКонфигурации");
			Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурации);
		Иначе
			// В ПКО для разных конвертаций объекты будут разные.
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОбъектКонфигурации%", "ПКО.ОбъектКонфигурации.Наименование = &ОбъектКонфигурации");
			Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектКонфигурации, "Наименование"));
		КонецЕсли;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОбъектКонфигурации%", "Истина");
	КонецЕсли;
	Если ИмяОбъектаФормата <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОбъектФормата%", "ПКО.ОбъектФормата = &ОбъектФормата");
		Запрос.УстановитьПараметр("ОбъектФормата", ИмяОбъектаФормата);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОбъектФормата%", "Истина");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПКО.Добавить(СокрЛП(Выборка.Имя));
	КонецЦикла;
КонецПроцедуры

// Заполнение списка алгоритмов для выбора алгоритма после загрузки всех данных в правиле конвертации объектов.
// Параметры:
//   СписокАлгоритмов - СписокЗначений - заполняемый список.
//   МассивКонвертаций - Массив - Конвертации для которых получается список.
Процедура ЗаполнитьСписокАлгоритмов(СписокАлгоритмов, МассивКонвертаций) Экспорт
	СписокАлгоритмов.Очистить();
	Если НЕ ЗначениеЗаполнено(МассивКонвертаций) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Алгоритмы.Код
	|ИЗ Справочник.Алгоритмы КАК Алгоритмы
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставКонвертаций
	|ПО СоставКонвертаций.ЭлементКонвертации = Алгоритмы.Ссылка
	|	И СоставКонвертаций.Владелец В (&МассивКонвертаций)
	|	И СоставКонвертаций.Отключить = ЛОЖЬ И СоставКонвертаций.ПометкаУдаления = ЛОЖЬ
	|ГДЕ Алгоритмы.ПометкаУдаления = ЛОЖЬ И Алгоритмы.ЭтоФункция = ЛОЖЬ
	|";
	Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяАлгоритма = СокрЛП(Выборка.Код);
		Если СписокАлгоритмов.НайтиПоЗначению(ИмяАлгоритма) = Неопределено Тогда
			СписокАлгоритмов.Добавить(ИмяАлгоритма);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Запись настроек пользователя в соответствующий регистр сведений.
// Параметры: 
//   СтруктураНастроек - структура - записываемые настройки.
Процедура ЗаписатьНастройкиПользователя(СтруктураНастроек) Экспорт
	
	НаборЗаписей = регистрыСведений.НастройкиПользователя.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Запись, СтруктураНастроек);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Получение настроек пользователя из регистра сведений.
// Возвращаемое значение:
//  ЗаписьВыборкиРезультатаЗапроса - запись, содержащая настройки.
Функция НастройкиПользователя() Экспорт
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	НастройкиПользователя.ТекущаяКонфигурацияИсточник,
		|	НастройкиПользователя.ТекущаяКонфигурацияПриемник,
		|	НастройкиПользователя.ИспользоватьОтборПоСтатусу,
		|	НастройкиПользователя.ОтборПоСтатусу
		|ИЗ
		|	РегистрСведений.НастройкиПользователя КАК НастройкиПользователя");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции
#КонецОбласти
#Область ПроверкаПередЗаписьюПравилИАлгоритмов
// Процедура предотвращает запись правила с измененным идентификатором, если на правило имеются ссылки.
// Параметры:
//  Отказ - Булево - Признак отказа от записи
//  ТекущийОбъект - СправочникОбъект.ПравилаКонвертацииОбъектов - проверяемый объект
//                 Может быть также передано Правило конвертации предопределенных данных
//  ПроверятьПОД - Булево - признак необходимости искать ссылки в правилах обработки данных.
Процедура ПроверитьВозможностьЗаписиПравила(Отказ, ТекущийОбъект, ПроверятьПОД = Истина) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		// Записан новый объект
		Возврат;
	КонецЕсли;
	Если СокрЛП(ТекущийОбъект.Ссылка.Код) = "" Тогда
		// Меняется пустое наименование на заполненное
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(ТекущийОбъект.Код) = СокрЛП(ТекущийОбъект.Ссылка.Код) Тогда
		// Идентификатор правила не изменился
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Владелец КАК Конвертация
	|ПОМЕСТИТЬ ТабКонвертации
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ ЭлементКонвертации = &Ссылка И ПометкаУдаления = ЛОЖЬ И Отключить = ЛОЖЬ
	|;
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПКС.Ссылка
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК ПКС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставКонвертации
	|ПО СоставКонвертации.ЭлементКонвертации = ПКС.Владелец
	|	И СоставКонвертации.Владелец В (ВЫБРАТЬ Конвертация ИЗ ТабКонвертации)
	|	И СоставКонвертации.ПометкаУдаления = ЛОЖЬ И СоставКонвертации.Отключить = ЛОЖЬ
	|ГДЕ ПКС.ПравилоКонвертацииСвойства = &ИдентификаторПравила
	|	И НЕ ПКС.Ссылка.Отключить И НЕ ПКС.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ИдентификаторПравила",ТекущийОбъект.Ссылка.Код);
	Запрос.УстановитьПараметр("Ссылка",ТекущийОбъект.Ссылка);
	ЕстьСсылкиИзПКС = Ложь;
	ЕстьСсылкиИзПОД = Ложь;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ЕстьСсылкиИзПКС = Истина;
	КонецЕсли;
	

	// Поиск ссылок на правило из ПОД
	Если ПроверятьПОД Тогда
		ЗапросПОД = Новый Запрос;
		ЗапросПОД.МенеджерВременныхТаблиц = МенеджерВТ;
		ЗапросПОД.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПОД.Ссылка
		|ИЗ Справочник.ПравилаОбработкиДанных КАК ПОД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК СоставКонвертации
		|ПО СоставКонвертации.ЭлементКонвертации = ПОД.Ссылка
		|	И СоставКонвертации.Владелец В (ВЫБРАТЬ Конвертация ИЗ ТабКонвертации)
		|	И СоставКонвертации.ПометкаУдаления = ЛОЖЬ И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ ПОД.ПравилоКонвертацииОбъекта = &ИдентификаторПравила
		|	И НЕ ПОД.Отключить И НЕ ПОД.ПометкаУдаления
		|;
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПОДТЧ.Ссылка
		|ИЗ Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов КАК ПОДТЧ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК СоставКонвертации
		|ПО СоставКонвертации.ЭлементКонвертации = ПОДТЧ.Ссылка
		|	И СоставКонвертации.Владелец В (ВЫБРАТЬ Конвертация ИЗ ТабКонвертации)
		|	И СоставКонвертации.ПометкаУдаления = ЛОЖЬ И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ ПОДТЧ.ПравилоКонвертацииОбъекта = &ИдентификаторПравила
		|	И НЕ ПОДТЧ.Ссылка.Отключить И НЕ ПОДТЧ.Ссылка.ПометкаУдаления";
		ЗапросПОД.УстановитьПараметр("ИдентификаторПравила",ТекущийОбъект.Ссылка.Код);
		РезультатыЗапросов = ЗапросПОД.ВыполнитьПакет();
		Если НЕ (РезультатыЗапросов[0].Пустой() И РезультатыЗапросов[1].Пустой()) Тогда
			Отказ = Истина;
			ЕстьСсылкиИзПОД = Истина;
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Внимание! Был изменен идентификатор правила.'") + Символы.ПС;
		Если ЕстьСсылкиИзПОД И ЕстьСсылкиИзПКС Тогда
			ТекстСообщения = ТекстСообщения + НСтр("ru = 'На это правило есть ссылки из правил обработки данных и правил конвертации свойств.'");
		ИначеЕсли ЕстьСсылкиИзПОД Тогда
			ТекстСообщения = ТекстСообщения + НСтр("ru = 'На это правило есть ссылки из правил обработки данных.'");
		Иначе
			ТекстСообщения = ТекстСообщения + НСтр("ru = 'На это правило есть ссылки из правил конвертации свойств.'");
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'Запись правила невозможна.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ТекущийОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

// Процедура предотвращает запись алгоритма с измененным идентификатором, если на алгоритм имеются ссылки.
// Параметры:
//  Отказ - Булево - Признак отказа от записи.
//  ТекущийОбъект - СправочникОбъект.Алгоритмы - проверяемый объект.
Процедура ПроверитьВозможностьЗаписиАлгоритма(Отказ, ТекущийОбъект) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		// Записан новый объект
		Возврат;
	КонецЕсли;
	Если СокрЛП(ТекущийОбъект.Код) = СокрЛП(ТекущийОбъект.Ссылка.Код) Тогда
		// Идентификатор алгоритма не изменился
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Владелец КАК Конвертация
	|ПОМЕСТИТЬ ТабКонвертации
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ ЭлементКонвертации = &Ссылка И ПометкаУдаления = ЛОЖЬ И Отключить = ЛОЖЬ
	|;
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПКО.Ссылка
	|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставКонвертации
	|ПО СоставКонвертации.ЭлементКонвертации = ПКО.Ссылка
	|	И СоставКонвертации.Владелец В (ВЫБРАТЬ Конвертация ИЗ ТабКонвертации)
	|	И СоставКонвертации.ПометкаУдаления = ЛОЖЬ И СоставКонвертации.Отключить = ЛОЖЬ
	|ГДЕ ПКО.АлгоритмПослеЗагрузкиВсехДанных = &ИдентификаторАлгоритма
	|	И НЕ ПКО.Ссылка.Отключить И НЕ ПКО.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ИдентификаторАлгоритма",ТекущийОбъект.Ссылка.Код);
	Запрос.УстановитьПараметр("Ссылка",ТекущийОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Внимание! Было изменено имя алгоритма.'") + Символы.ПС;
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'На этот алгоритм есть ссылки из правил конвертации объектов, свойство Алгоритм после загрузки всех данных.'");
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'Запись алгоритма невозможна.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ТекущийОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область РАБОТА_С_СОСТАВОМ_КОНВЕРТАЦИЙ
// Процедура записывает принадлежность элемента (правила, алгоритма) конвертациям, входящим в переданный список.
// Параметры:
//  ЭлементКонвертации - СправочникСсылка.СоставыКонвертаций - обрабатываемый элемент.
//  СписокКонвертаций - СписокЗначений - Список конвертаций, в которые следует включить элемент.
Процедура ЗаписатьЭлементКонвертацииВСоставКонвертации(ЭлементКонвертации, Знач СписокКонвертаций) Экспорт
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.СоставыКонвертаций
		|ГДЕ ЭлементКонвертации = &Ссылка
		|	И Владелец = &Конвертация";
	Для Каждого ЭлементСписка Из СписокКонвертаций Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Конвертация = ЭлементСписка.Значение;
		Запрос.УстановитьПараметр("Ссылка", ЭлементКонвертации);
		Запрос.УстановитьПараметр("Конвертация", Конвертация);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		СправочникОбъект = Справочники.СоставыКонвертаций.СоздатьЭлемент();
		СправочникОбъект.Владелец = Конвертация;
		СправочникОбъект.ЭлементКонвертации = ЭлементКонвертации;
		СправочникОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

// Процедура заполняет список конвертаций значениями: в какие конвертации входит переданный элемент конвертации.
// Параметры:
//   ЭлементКонвертации- СправочникСсылка.СоставыКонвертаций - обрабатываемый элемент.
//  СписокКонвертаций - СписокЗначений - Список конвертаций, в которые включен элемент.
//  ВедущаяКонфигурация - СправочникСсылка.Релизы - какая из конфигураций является вышестоящей.
Процедура ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(ЭлементКонвертации, СписокКонвертаций, ВедущаяКонфигурация = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|Владелец КАК Конвертация,
	|Владелец.Конфигурация КАК Релиз,
	|Владелец.Конфигурация.КонфигурацияВладелец КАК Конфигурация
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ ЭлементКонвертации = &Ссылка
	|	И Отключить = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ЭлементКонвертации);
	Выборка = Запрос.Выполнить().Выбрать();
	СписокКонвертаций.Очистить();
	Релизы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СписокКонвертаций.Добавить(Выборка.Конвертация);
		Релизы.Добавить(Выборка.Релиз);
	КонецЦикла;
	Если Релизы.Количество() = 1 Тогда
		ВедущаяКонфигурация = Релизы[0];
		Возврат;
	КонецЕсли;
КонецПроцедуры

// Функция преобразует список конвертаций в  массив конфигураций, для которых конвертации предназначены.
// Параметры:
//  СписокКонвертаций - Массив - список конвертаций. Может также передаваться список значений.
//  ИмяРеквизитаКонфигурация - Строка - Имя реквизита справочника Конвертации, из которого следует взять конвертацию.
// Возвращаемое значение:
//   Массив - конфигурации для которых предназначены конвертации.
Функция ПолучитьКонфигурацииДляКонвертаций(СписокКонвертаций, ИмяРеквизитаКонфигурация = "Конфигурация") Экспорт
	МассивКонфигураций = Новый Массив;
	Если ТипЗнч(СписокКонвертаций) = Тип("СписокЗначений") Тогда
		МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	Иначе
		МассивКонвертаций = СписокКонвертаций;
	КонецЕсли;
	
	Для каждого Конвертация Из МассивКонвертаций Цикл
		Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация, ИмяРеквизитаКонфигурация);
		Если МассивКонфигураций.Найти(Конфигурация) = Неопределено Тогда
			МассивКонфигураций.Добавить(Конфигурация);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивКонфигураций;
КонецФункции

// Функция проверяет, входит ли элемент конвертации (правило, алгоритм) в указанную конвертацию.
// Параметры:
//   Конвертация - СправочникСсылка.Конвертации - ссылка на конвертацию
//   ЭлементКонвертации - СправочникСсылка.ПравилаКонвертацииОбъектов - проверяемый элемент.
//                         Может быть передана ссылка на алгоритм, правило обработки данных, ПКПД,
// Возвращаемое значение:
//   Булево - признак вхождения в конвертацию.
Функция ЭлементКонвертацииВходитВСоставКонвертации(Конвертация, ЭлементКонвертации) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка 
	|ИЗ Справочник.СоставыКонвертаций КАК СоставКонвертации
	|ГДЕ СоставКонвертации.ЭлементКонвертации = &ЭлементКонвертации
	|		И СоставКонвертации.Владелец = &Конвертация
	|";
	Запрос.УстановитьПараметр("ЭлементКонвертации", ЭлементКонвертации);
	Запрос.УстановитьПараметр("Конвертация", Конвертация);

	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции

// Процедура выполняет пометку на удаление элемента справочника СоставыКонвертаций синхронно с пометкой на удаление
// соответствующего элемента конвертации.
// Параметры:
//   ЭлементКонвертации - СправочникСсылка.ПравилаКонвертацииОбъектов - проверяемый элемент.
//                         Может быть передана ссылка на алгоритм, правило обработки данных, ПКПД,
//   ПометкаУдаления - Булево - признак пометки удаления.
Процедура ОбработатьПометкуНаУдалениеЭлементаКонвертации(ЭлементКонвертации, ПометкаУдаления) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|Ссылка
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ ЭлементКонвертации = &Ссылка
	|	И ПометкаУдаления <> &ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", ЭлементКонвертации);
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоставКонвертацииОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СоставКонвертацииОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЦикла;
КонецПроцедуры

// Функция получает конвертации, в которые можно включить правило исходя из взаимосвязей объектов разных конфигураций.
// Параметры:
//  ЭлементКонвертации - СправочникСсылка.ПравилоКонвертацииОбъекта, СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных или
//      СправочникСсылка.ПравилаОбработкиДанных - обрабатываемое правило.
//  СписокКонвертаций - СписокЗначений - Список конвертаций, в которые включен элемент.
// Возвращаемое значение:
//   СписокЗначений - список конвертаций в которые можно включить элемент конвертации. 
Функция ПолучитьДополненныйСписокКонвертаций(ЭлементКонвертации, СписокКонвертаций) Экспорт
	КонвертацииКДобавлению = Новый СписокЗначений;
	ОбъектКонфигурации = Неопределено;
	ТекстЗапросаЭлементКонвертации = "";
	Если ТипЗнч(ЭлементКонвертации) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов")
		Или ТипЗнч(ЭлементКонвертации) = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда
		ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементКонвертации, "ОбъектКонфигурации, ИспользоватьДляОтправки, ИспользоватьДляПолучения");
		ОбъектКонфигурации = ДанныеПравила.ОбъектКонфигурации;
		ТекстЗапросаЭлементКонвертации = "ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка
		|ИЗ Справочник." + ?(ТипЗнч(ЭлементКонвертации) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов"), "ПравилаКонвертацииОбъектов", "ПравилаКонвертацииПредопределенныхДанных") + "
		|ГДЕ ОбъектКонфигурации = &Объект И ИспользоватьДляОтправки = &ИспользоватьДляОтправки И ИспользоватьДляПолучения = &ИспользоватьДляПолучения"
	ИначеЕсли ТипЗнч(ЭлементКонвертации) = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда
		ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементКонвертации, "ИспользоватьДляОтправки, ОбъектВыборки");
		Если ДанныеПравила.ИспользоватьДляОтправки Тогда
			ОбъектКонфигурации = ДанныеПравила.ОбъектВыборки;
			ТекстЗапросаЭлементКонвертации = "ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка
			|ИЗ Справочник.ПравилаОбработкиДанных
			|ГДЕ ОбъектВыборки = &Объект И ИспользоватьДляОтправки = ИСТИНА";
		КонецЕсли;
	КонецЕсли;
	Если ОбъектКонфигурации = Неопределено
		Или ОбъектКонфигурации = Справочники.Объекты.ПустаяСсылка() Тогда
		Возврат КонвертацииКДобавлению;
	КонецЕсли;
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Конвертация.Ссылка КАК Ссылка
		|ИЗ Справочник.Конвертации КАК Конвертация
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.Владелец = Конвертация.Ссылка И Состав.Отключить = ЛОЖЬ
		|	И Состав.ЭлементКонвертации В (" + ТекстЗапросаЭлементКонвертации + ")
		|ГДЕ Конвертация.Конфигурация = &Конфигурация
		|	И Конвертация.Ссылка НЕ В (&СписокКонвертаций)
		|	И Конвертация.ТипКонвертации = &ХДТО
		|	И Состав.Ссылка IS NULL";
	// Поиск конфигураций "вверх".
	ОбъектКонфигурацииТекущий = ОбъектКонфигурации;
	Пока ЗначениеЗаполнено(ОбъектКонфигурацииТекущий) Цикл
		ДанныеОбъектаКонфигурации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектКонфигурацииТекущий, "ОбъектВышестоящегоРелиза, Владелец");
		Если ЗначениеЗаполнено(ДанныеОбъектаКонфигурации.ОбъектВышестоящегоРелиза) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Конфигурация", ДанныеОбъектаКонфигурации.Владелец);
			Запрос.УстановитьПараметр("СписокКонвертаций", СписокКонвертаций);
			Запрос.УстановитьПараметр("ХДТО", Перечисления.ТипыКонвертаций.XDTO);
			Запрос.УстановитьПараметр("Объект", ДанныеОбъектаКонфигурации.ОбъектВышестоящегоРелиза);
			Если ДанныеПравила.Свойство("ИспользоватьДляОтправки") Тогда
				Запрос.УстановитьПараметр("ИспользоватьДляОтправки", ДанныеПравила.ИспользоватьДляОтправки);
			КонецЕсли;
			Если ДанныеПравила.Свойство("ИспользоватьДляПолучения") Тогда
				Запрос.УстановитьПараметр("ИспользоватьДляПолучения", ДанныеПравила.ИспользоватьДляПолучения);
			КонецЕсли;
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				 КонвертацииКДобавлению.Добавить(Выборка.Ссылка);
			КонецЕсли;		 
			ОбъектКонфигурацииТекущий = ДанныеОбъектаКонфигурации.ОбъектВышестоящегоРелиза;
		Иначе
			ОбъектКонфигурацииТекущий = Неопределено;
		КонецЕсли;
	КонецЦикла;
	// Поиск конфигураций "вниз".
	ОбъектКонфигурацииТекущий = ОбъектКонфигурации;
	Пока ЗначениеЗаполнено(ОбъектКонфигурацииТекущий) Цикл
		ЗапросНижестоящийОбъект = Новый Запрос;
		ЗапросНижестоящийОбъект.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка,
		|	Владелец
		|ИЗ Справочник.Объекты
		|ГДЕ ОбъектВышестоящегоРелиза = &ТекущийОбъект И НЕ ПометкаУдаления";
		ЗапросНижестоящийОбъект.УстановитьПараметр("ТекущийОбъект", ОбъектКонфигурацииТекущий);

		ВыборкаНижестоящийОбъект = ЗапросНижестоящийОбъект.Выполнить().Выбрать();
		Если ВыборкаНижестоящийОбъект.Следующий() Тогда
			ОбъектКонфигурацииТекущий = ВыборкаНижестоящийОбъект.Ссылка;
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Конфигурация", ВыборкаНижестоящийОбъект.Владелец);
			Запрос.УстановитьПараметр("СписокКонвертаций", СписокКонвертаций);
			Запрос.УстановитьПараметр("ХДТО", Перечисления.ТипыКонвертаций.XDTO);
			Запрос.УстановитьПараметр("Объект", ВыборкаНижестоящийОбъект.Ссылка);
			Если ДанныеПравила.Свойство("ИспользоватьДляОтправки") Тогда
				Запрос.УстановитьПараметр("ИспользоватьДляОтправки", ДанныеПравила.ИспользоватьДляОтправки);
			КонецЕсли;
			Если ДанныеПравила.Свойство("ИспользоватьДляПолучения") Тогда
				Запрос.УстановитьПараметр("ИспользоватьДляПолучения", ДанныеПравила.ИспользоватьДляПолучения);
			КонецЕсли;

			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				 КонвертацииКДобавлению.Добавить(Выборка.Ссылка);
			КонецЕсли;		
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат КонвертацииКДобавлению;	
КонецФункции

// Проверяет наличие тегов для Конфигурации, настраивает соответствующие элементы формы. 
// Параметры:
//  СписокКонвертаций - Список значений, конвертации которым принадлежит правило
//  ЕстьТеги - Булево, переменная признак использования тегов
//  ЭлементФормыТег - Элемент формы колонка табличной части Теги
Процедура ОпределитьИспользованиеТегов(СписокКонвертаций, ЕстьТеги, ЭлементФормыТег) Экспорт
	ЕстьТеги = Ложь;
	Для Каждого Конвертация Из СписокКонвертаций Цикл
		Релиз = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация.Значение, "Конфигурация"); 
		Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Релиз, "КонфигурацияВладелец");
		Если НЕ ЗначениеЗаполнено(Конфигурация) Или Конфигурация.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		ВыборкаТеги = Справочники.Теги.Выбрать(,Конфигурация);
		Если ВыборкаТеги.Следующий() Тогда
			ЕстьТеги = Истина;
			МассивПараметров = Новый Массив;
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", Конфигурация); 
			МассивПараметров.Добавить(ПараметрВыбора);
			ЭлементФормыТег.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Функция РодительВерхнегоУровня(ТекРодитель, ВышестоящиеРодители)
	Если ВышестоящиеРодители.Получить(ТекРодитель) <> Неопределено Тогда
		Возврат ВышестоящиеРодители.Получить(ТекРодитель);
	КонецЕсли;
	УровеньВверх = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекРодитель, "Родитель");
	Если НЕ ЗначениеЗаполнено(УровеньВверх) Тогда
		// Нашли старшего родителя.
		ДанныеРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекРодитель, "Тип, Наименование, ТипОбщегоСвойства");
		Возврат ДанныеРодителя;
	Иначе
		Возврат РодительВерхнегоУровня(УровеньВверх, ВышестоящиеРодители);
	КонецЕсли;
	
КонецФункции
#КонецОбласти
